with open("2a.txt") as fh:
    lines = fh.readlines()
    #print(len(lines))
    #print(lines)
    #用以上之程式將跑出以下
'''
['40523115\t40523108\t40523116\t40523144\t40523111\t40523141\t40523104\t40523102\t40523123\n', '40523137\t40523117\t40523135\t40523147\t40523146\t40523145\t40523122\t40523136\t40523132\n', '40523127\t40523126\t40523125\t40523124\t40523118\t40523131\t40523121\t40523120\t40523119\n', '40523105\t40523106\t40523107\t40523143\t40523128\t40523129\t40523130\t40523139\t40523133\n', '40523142\t40523148\t40523140\t40523113\t40523138\t40523134\t\t']
'''
g = 0
for i in range(len(lines)) :
        line = lines[i].strip()
        groups = line.split("\t")
        #將\t忽略
        #這裡打錯打成("/t") ，將變成每一行成為一組
        #print(groups)
        #groups指的是每一行
        for i in range (len(groups)):
            if i%3 == 0:
            #每三位一組，也就是說上面的3限制了人數，改成2時，將會變成兩人一組
                g += 1
                #增量為1
                print()
                #顯示時，空一行
                print("第" + str(g) + "組:")
                #顯示組別
                print(groups[i])
                #顯示該組第一位
            else:
                print(groups[i])
                #不將上兩行打入，將只顯示該組第一位同學